<?php if(isset($_GET['action'])&&($_GET['action']=="empty")){
session_unset();
header("location:index.php?page=cart");
} 
if(isset($_POST['name'],$_POST['adress'],$_POST['phone'])) {
  $ordered_food=$_SESSION['foods'];
  $sum=$_SESSION['sum'];
  $order=new stdClass();
  $order->name=$_POST['name'];
  $order->adress=$_POST['adress'];
  $order->price=$sum;
  $order->phone=$_POST['phone'];
  $order->foods=$ordered_food;

 $user->addOrder($order);

}
?>
<div id="reservation" class="light-wrapper">
        <section class="ss-style-top"></section>
        <div class="container inner">
            <h2 class="section-title text-center">Количка </h2>
            <div class="row">
            <?php if(!empty($_SESSION['foods'])){ ?>
              <center><button data-toggle="modal" data-target="#confirmModal" class="btn-lg btn-success" >Поръчай Сега! </button></center><br/> <?php } ?>
              <table class="table table-bordered">
              <thead>
              <th>Храна</th>
              <th>Сннимка</th>
              <th>Количество</th>
              <th>Цена&nbsp;&nbsp;&nbsp; <?= $_SESSION['sum'] ?> лв</th>

              </thead>
              <tbody>
              <?php foreach($_SESSION['foods'] as $f){ ?>
                <tr>
                <td><?=$f->name ?></td>
                 <td><center><img  height="50" width="50" src="foods/<?php echo $f->image; ?>"></center></td>
                  <td><?=$f->quantity ?></td>
                   <td><?=$f->price ?> лв</td>
                   </tr>
                   <?php } ?>

              </tbody>
                
              </table>  
                 <center><a href="index.php?page=cart&action=empty"><button  class="btn-lg btn-danger" >Изпразни количката  </button></a></center>
            </div>
     
            
            <!-- /.services --> 
        </div>
        <!-- /.container -->

    </div>
 <div class="modal fade " id="confirmModal" tabindex="-1" role="dialog">
  <div class="modal-dialog" role="document">

    <div class="modal-content">
       <form method="post">
      <div class="modal-header active">
        <button type="button" class="close" data-dismiss="modal" aria-label="Close"><span aria-hidden="true">&times;</span></button>
        <h4 class="modal-title">Потвърди поръчката</h4>
      </div>
      <div class="modal-body">
     
      <div class="form-group">
          <label> Име :</label>
          <input type="text" name="name" placeholder="Име" class="form-control" required >
      </div>
      <div class="form-group">
          <label> Адрес :</label>
          <input type="text" name="adress"placeholder="Адрес" class="form-control" required >
      </div>
      <div class="form-group">
          <label> Телефон (формат: xxxxxxxxxx):</label>
          <input name="phone" type="tel" placeholder="Телефон" pattern="^\d{4}\d{3}\d{3}$" class="form-control" required>
      </div>
       <div class="form-group">
      <textarea style="width:100%; " rows="7" onclick="this.focus();this.select()" readonly="readonly">І. ТЕМРМИНИ И ОПРЕДЕЛЕНИЯ:

Услуга/и са предоставяните от притежателя услуги по представяне на продуктите, доставка и промоционални акции.

Уебсайт/Сайт е обособено място в глобалната Интернет мрежа, достъпно чрез своя унифициран адрес (URL) по протокол HTTP, HTTPS или друг стандартизиран протокол и съдържащо файлове, програми, текст, звук, картина, изображение или други материали и ресурси.

Потребител e всяко лице, което ползва услугите, предоставяни от притажетеля

Злоумишлени и некоректни действия са действия или бездействия, нарушаващи Интернет етиката или нанасящи вреди на лица, свързани към Интернет или асоциирани мрежи, изпращане на нежелана поща (SPAM, JUNK MAIL), препълване на каналите (FLOOD), получаване на достъп до ресурси с чужди права и пароли, използване на недостатъци в системите с цел собствена облага или добиване на информация (HACK), извършване на действия, които могат да бъдат квалифицирани като промишлен шпионаж или саботаж, или предизвикване инсталация на вируси или системи за отдалечен контрол, смущаване нормалната работа на останалите потребители на интернет и асоциираните мрежи, извършване на каквито и да било действия, които могат да се квалифицират като престъпление или административно нарушение по българското законодателство или по законодателството на друга страна.

Доставка – предаване на поръчка, опаковане в подходящ за транспортиране вид и трансопртиране на поръчката до адрес предоставен от клиента.

Интернет страница по смисъла на настоящите Общи условия означава съставна и обособена част от уебсайт.
"Случайно събитие" е непредвидено или непредвидимо към момента на сключването на договора обстоятелство от извънреден характер, което прави предоставянето на услугите обективно невъзможно;



ІІ. ЗАЩИТА НА ЛИЧНИ ДАННИ

2.1 Притежателят не събира лични данни за посетителите на сайта извън технологично необходимата идентификационната информация, която сайтовете автоматично събират, докато сте в тях, както и минимално необходимата информация за извършване на доставките. Притежателят не използва и няма да използва, предоставя, продава или дава под наем каквато и да било част от тази автоматично събирана технологична информация при никакви обстоятелства и на никаква цена.
2.2 С приемането на настоящите общи условия посетителите и потребителите на сайта изразяват съгласието си за използване на тази технологично необходимата идентификационна информация, която сайтовете автоматично събират, както и доброволно предоставената от тях информация относно име и адрес за доставка, телефонен номер и мейл за обратна връзка.
2.3 Използването на "cookies" като идентификация при посещаване на сайтовете е малко количество информация, която уеб сървърът изпраща на уеб браузъра и която позволява на сървъра да събира обратна информация от браузъра. Повече информация за използването на "cookies" можете да намерите на http://www.cookiecentral.com.
2.3 Притежателят не съхранява по никакъв начин каквито и да е било данни за вашите кредитни или дебитни карти. Онлайн разплащанията се извършват, чрез препращане към модул за онлайн разплащания опериран от epay.bg, който модул обработва онлайн плащането и подава обратно статус към Притежателят за успешно извършено плащане.


ІІІ. ПРАВА И ЗАДЪЛЖЕНИЯ НА СТРАНИТЕ

3.1 Притежателят има право да променя дизайна, формата, технологията и услугите, които предоставят сайтовете, без предварително да известява потребителите затова.
3.2 Притежателят има право по свое усмотрение да изтрие част от услугите, които предлага или да ограничи достъпа до тях, за всички или определени потребители.
3.3 Притежателят има право при неизпълнение на договорни отношения, злоумишлени действия, непристойни коментари и други несъвместими с морала и добрата търговска практика действия да изтрие, ограничи и/или закрие информацията на произволен потребител и без право на преразглеждане.
3.4 Притежателят има право да търси отговорност и санкции свързани с услугите, които предоставя, ако е получил уведомление за нарушение в сайта от упълномощените органи по Българското законодателство или в случаите, когато потребител наруши договорни отношения, извърши злоумишлени действия, направи непристойни коментари и/или извърши други несъвместими с морала и добрата търговска практика действия.
 3.5 Притежателят е длъжен да уведомява органите на реда за нарушаване на нормите на обществения морал и Българското Законодателство, включително публикуването на порнографски материали и снимки, обиди, нежелана реклама, нарушаване на авторското право и сродните му права, нарушаване свободата и правата на личността, дескриминация, застрашаване на живота или здравето на обществото и потребителите на сайтовете.
3.6 Притежателят има правото да отдава с цел продажба в сайтовете си пространство на рекламодатели и да експонира, показва, изпраща, изпълнява, зарежда техни реклами и всякакви рекламни материали за собствени цели или за целите на клиентите, които обслужва.
3.7. Притежателят има право да генерира и изпраща на посочен от страна на потребителя електронен адрес синтезирана информация за новостите в предлаганите услуги под формата на електронен бюлетин, седмично меню или актуални промоции.
3.8 С приемането на настоящите общи условия Притежателят получава право да изпраща до потребителя съобщения по смисъла на чл. 6 от Закона за електронната търговия, като осигурява ясното и недвусмислено разпознаване на търговското съобщение като непоискано.
3.9 Притежателят се задължава да осигури на потребителя по ясен и недвусмислен начин възможност за отказ за получаване на съобщенията по т. 3.7 и т. 3.8.

3.10 Потребителят има право безплатно да ползва услугите предоставяни от сайтовете за нетърговски цели,
 3.11 Потребителят има право на достъп в режим on-line до услугите, при спазване на условията и изискванията за достъп.
             3.12 Правото на достъп на Потребителя не включва правото да се копира или възпроизвежда информация, материали и ресурси, както и да използува обекти на интелектуална собственост, освен, ако се касае за незначителен по обем информация, предназначена за лично ползване, при условие че не се увреждат неоправдано законните интереси на авторите или други носители на права на интелектуална собственост и в случай че копирането или възпроизвеждането се извършва с нетърговска цел.
            3.14 Потребителят има право да посочи електронен адрес, на който иска да получава синтезирана информация за новостите публикувани в сайта на Притежателя под формата на електронен бюлетин.
            3.15 Потребителят има право да откаже, посредством начините предоставени от Притежателя получаването на съобщенията по т. 3.7 и т. 3.8, като отказа от получаването на съобщенията лишава потребителя от възможността да участва в промоционалните предложения, изискващи изпращането на ваучери и/или обратна връзка.
3.16 Потребителят е длъжен да уведоми предварително по подходящ начин Притежателят в случай, че използвания при регистрацията мейл адрес е в регистъра на електронни адреси на юридически лица, които не желаят да получават непоискани търговски съобщения.


IV. ДОСТАВКИ НА ХРАНА И ПРОМОЦИОНАЛНИ АКЦИИ

Минималната стойност на поръчката трябва да бъде 5.99лв.

4.1. Притежателят предоставя  услугата - доставка на храна до дома и офиса, в рамките на гр.София.
4.2 Приемането на поръчки за доставка се извършва он-лайн - чрез сайта или чрез друго комуникационно средство, мобилно или уеб-базирано приложение, предоставени за контакт в сайта   www.pizzadonvito.com
4.2 Доставките се извършват от оторизирани служители на съответния ресторант ДОН ВИТО
4.3. Доставката на поръчаните артикули се извършва до точен адрес (блок, вход, етаж и апартамет), посочен от потребителя, а също така и при предоставен телефон за обратна връзка.
4.4. Доставката на поръчаните артикули се извършва до входната врата (при наличие на охрана в жилищната кооперация, при заключен вход, при неработещ асансьор или работещ такъв, но с чип или карта) на блока или офиса. При свободен достъп и работещ асансьор, доставчикът би могъл да стигне до вратата на апартамента или офиса.
4.5. Доставката на поръчаните артикули се извършва в рамките на около 60 минути от приемане на поръчката. В случаи на форсмажорни обстоятелства (лоши метеорологични условия, пътни инциденти и др.), времето за поръчка може да е неопределено или поръчката може да бъде анулирана от притежателя.
4.6. Поръчката, предмет на доставка, се транспортира и доставя подходящо опакована и в разумни срокове, в зависимост от часовия пояс и натовареността на ресторантите ДОН ВИТО.
4.7. Регистрацията в сайта www.pizzadonvito.com дава право на потребителите на участие в промоционалните акции , провеждани от Притежателя




V. ОГРАНИЧЕНИЕ НА ОТГОВОРНОСТТА

5.1. Предоставянето на услугите и достъпа до ресурсите на сайтовете не обхваща осигуряване на компютърно оборудване и свързаност за пренос на информационни пакети между потребителя и интернет страницата, необходими за осъществяване достъп до ресурсите на уебсайта. Притежателят не носи отговорност за каквито и да са смущения или технически проблеми, дължащи се на случайни събития и на такива свързани с ползването на услугите, вследствие експлоатирането на компютърното оборудване от потребителя (хардуерен или софтуерен проблем, проблем с интернет свързаност и др.).
5.2  Притежателят не носи отговорност за злоумишлени и некоректни действия от страна на трети лица.
            5.3 Отговорност за съдържанието на рекламните материали носят само и единствено рекламодателите. Рекламите и другите разположени в сайтовете материали от трети лица следва да са изработени в съответствие с действащото национално и общностно законодателство в областта на защита на индустриалната собственост, авторските права, конкуренцията, потребителите и да са съобразени с правилата за добросъвестна търговска практика и добрите нрави.


VI. ДЕЙСТВИЕ, ПУБЛИКУВАНЕ И ПРОМЯНА НА ОБЩИТЕ УСЛОВИЯ

6.1. Връзки към Общите условия са разположени по обичаен начин в долната част на сайтовете на Притежателят.
6.2. С подаването на заявка от потребител и получаването на отговор за зареждане, независимо от географското местоположение на потребителя, включително чрез индиректно зареждане, посредством използване на хипервръзка ("електронна препратка" по смисъла на Закона за електронната търговия), банер и/или друг подходящ начин, съобразно използваната технология, към него от друг уебсайт, както и с доброволна регистрация потребителят извършва електронно изявление по смисъла на Закона за електронния документ и електронния подпис, с което декларира, че желае да ползва услугите предоставяни от Притежателят, че е запознат с настоящите Общи условия, като в отношенията между него и Притежателя те имат силата на договор, който трябва да се спазва.
6.3. Общите условия са в сила за страните от извършването на електронното изявление от страна на потребителя до момента на прекратяване използването на услугите на Притежателя чрез напускане на съответния сайт, като при всяко ново влизане се сключва нов договор.
6.4. При изменения и/или допълнения на Общите условия, притежателя уведомява потребителите по подходящ начин за извършените промени – като публикува на видно място в Интернет страницата си съобщение за направените изменения и/или допълнения в Общите условия и текста на извършените промени не по-късно от 7 дни преди влизане в сила на измененията и/или допълненията.
6.6. Общи условия влизат в сила от датата на тяхното публикуване и последна им актуализация

VІI. СПОРОВЕ

Всички спорове, породени от тези Общи условия или отнасящи се до тях, включително споровете, породени или отнасящи се до техните тълкувания, недействителност, изпълнение или прекратяване, както и споровете за попълване на празноти в тях или приспособяването им към нововъзникнали обстоятелства, ще бъдат разрешавани чрез преговори, а в случай не непостигане на съгласие -  по съдебен ред
</textarea>
     
      </ul>
      </div>
      <div class="form-group">  
      <input type="checkbox" class="" required="required" > Съгласи се с правилата
      </div>
     
      
      
      </div>
      <div class="modal-footer">
        <button type="button" class="btn btn-warning" data-dismiss="modal">Затвори</button>
        <input type="submit" class="btn btn-success" value="Потвърди">
      </div>

      </form>
    </div><!-- /.modal-content -->
    
  </div><!-- /.modal-dialog -->
</div><!-- /.modal -->

